%%第一题
%高压油管的容积为V_0
%一次周期的喷油量记Q_c
%100MPa压强下，燃油的密度记为R_0
%160MPa压强下，燃油的密度记为R_1
%150MPa压强下，燃油的密度记为R_2
%设维持100MPa单向阀门开启一次时常为t_0;
V_0 = pi*5^2*500;
R_0 = 0.850;
syms R
R_1 = fzero(@(R) 2786.4*log(R)+452.9-160,1);
R_2 = fzero(@(R) 2664.3*log(R)+452.9-150,1);
%syms P
%equ = (0.0289*P^2+3.0765*P+1571.6)*log(R) + 459.2 - P == 0;
%R_P = solve(equ,R,'ReturnConditions',true);

%C为流量系数
%r为A处小孔半径
%A为A处小孔面积
C = 0.85;
r = 0.71;
A = pi*r^2;
Q_0 = C*A*(2*(160-100)/R_1)^0.5;
Q_c = 20*(2+2.4)/2;
syms t_0
fun_0 = @(t_0) (R_1*Q_0*t_0/(t_0+10)-R_0*Q_c/100);
t_0 = fzero(fun_0,0.5);
%设提升至150MPa 单向阀门开启一次时长为t_1,t_2,t_3
%分别对应经过2s 5s  10s的调整后稳定
%设油管内燃油的质量差为 deltaM mg
deltaM = (R_2 - R_0)*V_0;
%设在t_1、t_2、t_3情况下，等效进油量分别为Q_1 Q_2 Q_3
syms t
%计算t_1
Q_1 = integral(@(t) C*A*(2*(60-6.57*log(t+1)/R_1)).^0.5,0,2000)/2000;
R_c1 = 0.87;
fun_1 = @(x) 2000*(Q_1*x/(x+10)*R_1-Q_c/100*R_c1) - deltaM;
t_1 = fzero(fun_1,10);
test1 = fun_1(2000);
%在假设的模拟之下，每次开启阀门的时间为2.7511ms

%计算t_2
Q_2 = integral(@(t) C*A*(2*(60-5.87*log(t+1)/R_1)).^0.5,0,5000)/5000;
R_c2 = 0.88;
fun_2 = @(x) 5000*(Q_2*x/(x+10)*R_1-Q_c/100*R_c2) - deltaM;
t_2 = fzero(fun_2,5);
test2 = fun_2(5000);
%在假设的模拟之下，每次开启阀门的时间为1.5160ms

%计算t_3
Q_3 = integral(@(t) C*A*(2*(60-5.43*log(t+1)/R_1)).^0.5,0,10000)/10000;
R_c3 = 0.88;
fun_3 = @(x) 10000*(Q_3*x/(x+10)*R_1-Q_c/100*R_c3) - deltaM;
t_3 = fzero(fun_3,0.5);
%在假设的模拟之下，每次开启阀门的时间为1.1524ms


%维持150MPa所需的开启时长
Q_00 = C*A*(2*(160-150)/R_1)^0.5;
syms t_4
fun_4 = @(t_4) (R_1*Q_00*t_4/(t_4+10)-R_2*Q_c/100);
t_4 = fzero(fun_4,0.5);
%维持150MPa每次开启时间为0.7383ms



%%第二题
%针阀半径记为r_1
%喷孔半径记为r_2
%升程为s，面积为A
r_1 = 1.25;
r_2 = 0.7;
A_k = pi*r_2^2;
k = ((r_1^2+r_2^2)^0.5-r_1)/tand(9);
%通过附件2的数据可知，在时间为0.37ms、2.08ms左右
%先后两次圆环面积与喷孔面积相等
t1 = 0.37;
t2 = 2.08;
%从t1到t2之间，喷孔可以视作“全开”状态，计算喷油速率如下
Q0 = C*A*(2*(100-0.5)/R_0).^0.5;
%从0到t1之间，喷孔的喷油速度是一个关于t的函数
syms t
st = @(t) 16.367*t.^2-2.274*t+0.0444;
%模拟函数st的R^2 = 0.9922
dr = @(st) (st*tand(9));
At = @(dt) pi*(2*r_1*dr+dr.^2);
Qct = @(At) C*At*(2*(100-0.5)/R_0).^0.5;
%对Qct积分，可得0到t1的燃油流出体积,进而算出一个周期的燃油流出质量
Mc = R_0*(Q0*(2.08-0.37)+2*integral(Qct,0,1.9336));

%由附件1
h = 7.239-2.413;
Vs = 20;
rn = 2.5;
%低压状态下的燃油密度设为R_3
R_3 = fzero(@(R) 1538.4*log(R)+452.9-0.5,1);
Mz = R_3*(Vs + pi*rn^2*h)-(Vs)*R_0;
omg =2*pi/(100*Mz/Mc);

%%第三题
%第三题为了维持油管内燃油质量的稳定，凸轮的转速应达到第二题的两倍
%讨论怎样分布喷油孔B、C的喷油时间，让油管内的燃油压强尽量维持恒定
%此时的“恒定”是指在时间变化的过程中，油管内燃油质量的波动尽可能地小

T = pi/omg;
%在这种情况下凸轮转动的周期T为48.0712毫秒，约为喷油孔工作周期的一半
%为了使燃油质量的波动尽可能小，需要预充油，且把两个喷油嘴的工作时间分开
syms hx
h0 = fzero(@(hx) R_3*(Vs+pi*rn^2*h) - R_0*(Vs + pi*rn^2*hx),1);
%根据附件1的数据，得出结论极角为2.35rad时，阀门打开
%所以只有高压油泵每个周期0.1258T（即6.0472ms）时间阀门打开，其他时间阀门关闭

%所以最佳的供油和喷油策略分别是：
%供油策略：凸轮转速增加为0.1307rad/ms
%喷油策略：当供油开始后0.3824ms，B、C喷油孔交替喷油，且两个喷油孔周期间隔为2.8324ms

%如果加上了减压阀D，不妨将其一直打开，在两个喷油嘴正常工作的情况下，计算凸轮转速
Md = Q0*100*R_0;
omg_z =2*pi*(Md+2*Mc)/(100*Mz);
%如果一直开启减压阀D，凸轮的转速为1.6707rad/ms
%在D阀一直打开的情况下，如果B、C中有一个喷口故障堵塞
%考虑如下：
syms p;
in1 = fzero(@(x) x-omg_z*Mz/(2*pi),1);
Mcg =@(x) R_0*(100*x+x*(2.08-0.37)+2*integral(Qct,0,1.9336))-in1*100;%此处忽略燃油密度的变化
in2 = fzero(Mcg,0);
Qp = @(p) C*A*(2*(p-0.5)/R_0).^0.5-in2;
Pg = fzero(Qp,100);
%计算出在D口一直打开，B、C喷油孔其中一个故障的情况下
%高压油管内的压强仍然能维持在108.1242MPa左右